_posts/soft/2016-08-23-pc-change-rec.html
---
date: 2016-08-23
tags: 
- pc
- 修改
- 记录
author: yefeiyu
layout: post
title: pc change rec
subtitle: 日常修改的记录
categories: 
- mobile
extra-yaml-headers: theme: \nplugin: \nscheme-text: "#eeffee"\nscheme-link: "#ddffdd"\nscheme-hover: "#ffddff"\nscheme-code: "#ffeeff"\nscheme-bg: "#9400d3"\nscheme-hero-text: "#9400d3"\nscheme-hero-link: "#8b008b"\nscheme-hero-bg: "#ffccff"\nscheme-bg-light: \n
extra-yaml-headers: theme: \nplugin: \nscheme-text: "#8b4513"\nscheme-link: "#d2691e"\nscheme-hover: "#"\nscheme-code: "#"\nscheme-bg: "#ffeebd"\nscheme-hero-text: "#ffdead"\nscheme-hero-link: "#f4a460"\nscheme-hero-bg: "#8b4513"\nscheme-bg-light: true\n
extra-yaml-headers: theme: \nplugin: \nscheme-text: "#2b003b"\nscheme-link: "#00008b"\nscheme-hover: "#"\nscheme-code: "#"\nscheme-bg: "#ffe7e5"\nscheme-hero-text: "#ffc3c3"\nscheme-hero-link: "#daab87"\nscheme-hero-bg: "#5b005b"\nscheme-bg-light: true\n
---

<div id="outline-container-org1b9a713" class="outline-2">
<h2 id="org1b9a713"><span class="section-number-2">1</span> <span class="timestamp-wrapper"><span class="timestamp">&lt;2018-04-10 Tue&gt;</span></span></h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org1eb14cb" class="outline-3">
<h3 id="org1eb14cb"><span class="section-number-3">1.1</span> How to execute command on startup (rc.local alternative)</h3>
<div class="outline-text-3" id="text-1-1">
<p>
which involves use of systemd here:
</p>
</div>
<ol class="org-ol">
<li><a id="org16a8ed1"></a>Create a service:<br />
<div class="outline-text-4" id="text-1-1-1">
<pre class="example">
sudo vi /etc/systemd/system/rc-local.service
</pre>
</div>
</li>
<li><a id="org7dc04ac"></a>Add your code there:<br />
<div class="outline-text-4" id="text-1-1-2">
<pre class="example">
[Unit]
Description=/etc/rc.local Compatibility
ConditionPathExists=/etc/rc.local

[Service]
Type=forking
ExecStart=/etc/rc.local start
TimeoutSec=0
StandardOutput=tty
RemainAfterExit=yes
SysVStartPriority=99

[Install]
WantedBy=multi-user.target
</pre>
</div>
</li>
<li><a id="org024bc77"></a>Create and make sure /etc/rc.local is executable and add this code inside it:<br />
<div class="outline-text-4" id="text-1-1-3">
<pre class="example">
sudo chmod +x /etc/rc.local
</pre>
<pre class="example">
#!/bin/sh -e
#
# rc.local
#
# This script is executed at the end of each multiuser runlevel.
# Make sure that the script will "exit 0" on success or any other
# value on error.
#
# In order to enable or disable this script just change the execution
# bits.
#
# By default this script does nothing.

exit 0
</pre>
</div>
</li>
<li><a id="org9e533cc"></a>Enable the service:<br />
<div class="outline-text-4" id="text-1-1-4">
<pre class="example">
sudo systemctl enable rc-local
</pre>
</div>
</li>
<li><a id="org26162f5"></a>Start service and check status:<br />
<div class="outline-text-4" id="text-1-1-5">
<pre class="example">
sudo systemctl start rc-local.service
sudo systemctl status rc-local.service

</pre>

<p>
If all goes well you can add your code to the /etc/rc.local file then restart it.
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-org0820b7a" class="outline-3">
<h3 id="org0820b7a"><span class="section-number-3">1.2</span> openbox close sleep and screensaver</h3>
<div class="outline-text-3" id="text-1-2">
<pre class="example">

#xset s 300      #设置屏保时间为300秒，时间单位为秒
#xset s 0        #关闭屏幕保护
#xset dpms 0 0 0 # 三个数值分别为Standby、Suspend、Off，单位秒
#xset -dpms      #关闭电源管理

</pre>
</div>
</div>
<div id="outline-container-orgfd9adec" class="outline-3">
<h3 id="orgfd9adec"><span class="section-number-3">1.3</span> openbox environment setup</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Setting up your environment
</p>

<p>
If you would like to set environment variables that will affect everything run in your current session (including Openbox), you can place them in ~/.config/openbox/environment. Here's an example ~/.config/openbox/environment file:
</p>
<pre class="example">
# Set up my own path
export PATH=$HOME/bin:$PATH

# Change the language used from the system's default
export LC_CTYPE=ja_JP.utf8

# SCIM for typing non-english characters
export XMODIFIERS=@im=SCIM
export GTK_IM_MODULE=scim
export QT_IM_MODULE=scim
</pre>
</div>
</div>

<div id="outline-container-org0c7e558" class="outline-3">
<h3 id="org0c7e558"><span class="section-number-3">1.4</span> openbox keyblinding setup, ~/.config/openbox/rc.xml</h3>
<div class="outline-text-3" id="text-1-4">
<pre class="example">
&lt;!-- Keybindings for running applications --&gt;
&lt;keybind key="W-e"&gt;
  &lt;action name="Execute"&gt;
    &lt;startupnotify&gt;
      &lt;enabled&gt;true&lt;/enabled&gt;
      &lt;name&gt;kfmclient&lt;/name&gt;
    &lt;/startupnotify&gt;
    &lt;command&gt;pcmanfm&lt;/command&gt;
  &lt;/action&gt;
&lt;/keybind&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org39e8c7c" class="outline-2">
<h2 id="org39e8c7c"><span class="section-number-2">2</span> <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-06-01 Thu&gt;</span></span></h2>
<div class="outline-text-2" id="text-2">
<p>
chane the _app/assets/themes/curtana/<sub>less</sub>/common.less
table {
</p>

<p>
tr:nth-child(even){background-color: #f5f2ff}
</p>

<p>
th {
    background-color: #cC0Ff0;
    color: white;
}
     // TODO: responsive table support
</p>
<ul class="org-ul">
<li>// display: inline-block;</li>
<li>// overflow-x: auto;</li>
<li>// white-space: nowrap;</li>
<li>display: inline-block;</li>
<li>overflow-x: auto;</li>
<li>white-space: nowrap;</li>
</ul>
<p>
}
and then the TABLE had 横拉滚动条
</p>
</div>
</div>
<div id="outline-container-org742e30f" class="outline-2">
<h2 id="org742e30f"><span class="section-number-2">3</span> <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-04-14 Fri&gt;</span></span></h2>
<div class="outline-text-2" id="text-3">
<p>
A friend sent me an email with a JPEG photo in the middle of the text. The picture is so big, most of it is outside the screen and I want to view it with an outside image viewer and not in Gnus. How do I save an image that is included in the email in Gnus, if it's not just an ordinary attachment?
</p>

<p>
The command you need is gnus-summary-save-parts. You have an inline image, which implies that you received an HTML mail. An inline image is an instance of a so-called MIME part, where MIME is an Internet standard governing email-related things such as non-text attachments.
</p>

<p>
L ;;list all group of gnus
X m ;;save image to ~/
</p>

<p>
debian chrome extensions installation is not enabled.
se /etc/environment
CHROMIUM<sub>FLAGS</sub>='&#x2013;enable-remote-extensions'
</p>
</div>
</div>

<div id="outline-container-org8d3f344" class="outline-2">
<h2 id="org8d3f344"><span class="section-number-2">4</span> <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-04-13 Thu&gt;</span></span></h2>
<div class="outline-text-2" id="text-4">
<p>
export WINEARCH=win32
export WINEPREFIX=$HOME/.mynewwine32prefix/
</p>

<p>
bash winetricks dotnet30
proxychains4 bash winetricks dotnet40
</p>

<p>
wget kegel.com/wine/winetricks &amp;&amp; sh winetricks ie8 ;;this is too old.
</p>

<p>
emacs: error while loading shared libraries: libpng12.so.0: cannot open shared object file: No such file or directory
<a href="https://packages.debian.org/jessie/libpng12-0">HERE</a>
s dpkg -i lib*
s apt-get install -f
</p>
</div>
</div>

<div id="outline-container-org37099b4" class="outline-2">
<h2 id="org37099b4"><span class="section-number-2">5</span> <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-03-02 Thu&gt;</span></span></h2>
<div class="outline-text-2" id="text-5">
<p>
install wine-qq on debian
<a href="http://www.longene.org/forum/viewtopic.php?f=6&amp;t=30516">HERE</a>
</p>
</div>
</div>

<div id="outline-container-org3993b21" class="outline-2">
<h2 id="org3993b21"><span class="section-number-2">6</span> <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-01-24 Tue&gt;</span></span></h2>
<div class="outline-text-2" id="text-6">
<p>
change emacs' color in terminator, add this line to .bashrc
export TERM=xterm-256color
</p>

<p>
define terminator's default position, change the '.local/share/applications/terminator.desktop' to:
terminator &#x2013;geometry=1200x900+0+0
</p>

<p>
add the font of msyh.ttf
</p>

<p>
define the font by #gnome-tweak-tool
</p>
</div>
</div>

<div id="outline-container-orgfe819b2" class="outline-2">
<h2 id="orgfe819b2"><span class="section-number-2">7</span> <span class="timestamp-wrapper"><span class="timestamp">&lt;2016-12-19 Mon&gt;</span></span></h2>
<div class="outline-text-2" id="text-7">
<p>
#spni -g n ;; to install npm's extension n
#s n 7.2.1 ;;to install nodejs v7.2.1
</p>
</div>
</div>

<div id="outline-container-org4d639d9" class="outline-2">
<h2 id="org4d639d9"><span class="section-number-2">8</span> <span class="timestamp-wrapper"><span class="timestamp">&lt;2016-08-23 Tue&gt;</span></span></h2>
<div class="outline-text-2" id="text-8">
<p>
.emacs
L625
  (setq myvar/relative-filename (concat "<a href="http://yefeiyu.github.io/img/">Here</a>" myvar/img-name))
</p>
</div>
</div>
<div id="outline-container-org059e5b5" class="outline-2">
<h2 id="org059e5b5"><span class="section-number-2">9</span> <span class="timestamp-wrapper"><span class="timestamp">&lt;2016-08-25 Thu&gt;</span></span></h2>
<div class="outline-text-2" id="text-9">
<p>
sudo apt-get install bleachbit
sudo apt-get install sweeper 
sudo apt-get remove sweeper
sudo dpkg -i nautilus<sub>nutstore</sub><sub>amd64.deb</sub> 
<span class="timestamp-wrapper"><span class="timestamp">&lt;2016-09-21 Wed&gt;</span></span>
install vmware debian and windows xp.
debian:
sai xfce4
add 6 keyboads shortcut, such as emacs, conkeror, gnus
change the desktop to 600x800, which need change the VGA1 to Virtual1
rehook dropbox to <i>home/xx/Dropbox
change conkerorrc's qiushi to 98%, and /</i>.
</p>

<p>
eba
alias gl='git pull'
</p>
</div>
</div>
